Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/local_authority_and_social_housing/your_rights_as_a_housing_association_tenant.html.txt.tmx
Source language: en
Languages: ga

source: Your rights as a housing association tenant
ga: Do chearta mar thionónta chumann tithíochta

source: If you are a tenant of a housing association or other voluntary housing organisation, your tenancy is now covered by the residential tenancies legislation. Housing associations, co-operatives and similar organisations, known as approved housing bodies (AHBs) were brought under the scope of this legislation on 7 April 2016. Two major effects of this change are:
ga: Tá na cearta atá agat mar thionónta chumann tithíochta mórán mar an gcéanna leo siúd atá ag tionóntaithe údaráis áitiúil, le difríocht mhór amháin: níl sé de cheart agat mar thionónta chumann tithíochta do theach a cheannach ón gcumann tithíochta

source: As noted above, since 7 April 2016 housing associations and other approved housing bodies come under the scope of the residential tenancies legislation. On this date the relevant sections of the Residential Tenancies (Amendment) Act 2015, which amended the Residential Tenancies Act 2004, came into effect
ga: Más mian leat tuilleadh eolais a fháil maidir le buaine sealbhaíochta, is é sin chomh héasca atá sé tú a dhíshealbhú, is féidir tuilleadh eolais maidir le fógra scoir agus díshealbhú a fháil

source: While there are several types of approved housing body, the term housing associations is often used when referring to all types. Read more about these bodies
ga: Má tá riaráistí cíosa agat agus má theastaíonn uait fáil amach céard ba cheart duit a dhéanamh futhu, is féidir tuilleadh eolais maidir le riaráistí cíosa a fháil

source: • While the housing association can validly end your tenancy providing all the legal requirements are met, it cannot terminate a Part 4 tenancy for the reason that it requires the dwelling for its own or family member occupation
ga: Más comhthionónta thú agus má thagann deireadh le do chaidreamh leis an gcomhthionónta eile agus má tá sé/sí imithe, is féidir tuilleadh eolais a fháil maidir le tithíocht agus briseadh síos caidrimh

source: If you are a joint tenant and your relationship with your joint tenant has ended and they have left, you can read information about housing and relationship breakdown here
ga: Má mian leat a fháil amach céard is féidir leatsa nó leis an gcumann tithíochta a dhéanamh maidir le iompar frithshóisialta is féidir tuilleadh eolais a fháil anseo maidir le iompar frithshóisialta agus tithíocht

source: To find out what you or the housing association can do about anti-social behaviour, you can read about anti-social behaviour and housing here. To find out about passing on a tenancy if someone dies, contact the housing association to establish its policy
ga: Más mian leat tuilleadh eolais a fháil maidir le tionóntacht a thabhairt do dhuine eile nuair a chailltear duine, ba cheart duit dul i dteagmháil leis an gcumann tithíochta cuí lena pholasaí ar an gceist seo a fháil

source: To find out who is responsible for different types of repair and the minimum physical standards you are entitled to, you can read about repairs, maintenance and minimum physical standards here
ga: Más mian leat a fháil amach cé atá freagrach as cineálacha éagsúla deisiúcháin agus na bunchaighdeáin fisiciúla atá tú ina dteideal, is féidir léamh maidir le deisiúcháin, cothabháil agus na bunchaighdeáin fisiciúla anseo

source: If you or a member of your family has a physical or intellectual disability or mental health difficulties, and your home requires alteration in order to make it suitable, you may be entitled to a Housing Adaptation Grant for a Person with a Disability
ga: Má tá míchumas fisiciúil nó intleachtúil nó fadhbanna sláinte intinne agat nó ag duine ar d'aithne agus má theastaíonn do theach a chur in oiriúint don duine sin d'fhéadfadh sé go mbeadh tú i dteideal Deontas Tithíochta Daoine le Míchumas

source: For any queries about your rights and obligations, you can contact your housing association or one of the representative bodies – the Irish Council for Social Housing or Co-operative Housing Ireland (formerly NABCo). You can also contact Threshold, the national housing charity, for information and advice. Irish Council for Social Housing 50 Merrion Square East Dublin 2 Ireland Tel:(01) 661 8334 Fax:(01) 661 0320 Homepage: http://www.icsh.ie Email: info@icsh.ie Co-operative Housing Ireland Co-operative House 33 Lower Baggot Street Dublin 2 Ireland Tel: (01) 661 2877 or (01) 661 0324 Fax: (01) 661 4462 Homepage: http://www.nabco.ie/ Email: admin@nabco.ie Threshold 21 Stoneybatter Dublin 7 Ireland Opening Hours:Mon-Fri 9.30 am - 5 pm Tel:1890 334 334 Fax:(01) 677 2407 Homepage: http://www.threshold.ie Email: advice@threshold.ie Residential Tenancies Board PO Box 47 Clonakilty Co
ga: Más mian leat bogadh isteach i dteach atá in úinéireacht ghaoil ach nach féidir leat mar gheall go bhfuil sé ró bheag nó nach sásaíonn sé na bunchaighdeáin, is féidir leat tuilleadh eolais a fháil maidir le Deontas Oiriúnaithe Tithe do Dhaoine faoi Mhíchumas
